/************************************************************************************//**
* \file         Demo/ARMCM0_STM32C0_Nucleo_C071RB_CubeIDE/Boot/App/usbmsc.c
* \brief        USB mass storage class for OpenBLT source file.
* \ingroup      Boot_ARMCM0_STM32C0_Nucleo_C071RB_CubeIDE
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2026  by Feaser    http://www.feaser.com    All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published by the Free
* Software Foundation, either version 3 of the License, or (at your option) any later
* version.
*
* OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
* without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
* PURPOSE. See the GNU General Public License for more details.
*
* You have received a copy of the GNU General Public License along with OpenBLT. It

 *         start with the boot sector and end with the README.TXT file contents.
 */
#define USB_MSC_FIXED_BLOCKS        (sizeof(usbMscFat12Partition)/USB_MSC_BLOCK_SIZE)

/** \brief The total number of blocks on the storage device. This is the fixed ones and
 *         the additional ones that could potentially cover the entire flash of the
 *         microcontroller. This value is stored at indices 19-20 in the boot sector.
 *         Note that not all this flash is actualy available to the user program though,
 *         as the first part is reserved for the bootloader.
 */
#define USB_MSC_TOTAL_BLOCKS        (((blt_int16u)(usbMscFat12Partition[0][20]) << 8U)| \
                                     usbMscFat12Partition[0][19])

/** \brief FAT archive attribute. When a file is copied to or modified on a FAT
 *         partition, it always gets the archive attribute set. Can be used to
 *         differentiate between other files and directories, such as the "System
 *         Volume Information" directory and a "IndexerVolumeGuid" file that Windows
 *         always created when inserting a USB MSC device for the first time.
 */
#define USB_MSC_FAT_ATTR_ARCHIVE    (0x20U)

/** \brief The root directory of a FAT12 partition at LBA 3 holds up to 16 entries of
 *         each 32 bytes.
 */
#define USB_MSC_FAT_ROOTDIR_ENTRIES (16U)

/** \brief The root directory logical block address of the FAT12 partition. It's the
 *         fourth block, so LBA 3.
 */
#define USB_MSC_FAT_ROOTDIR_LBA     (3U)


/****************************************************************************************
* Configuration check
****************************************************************************************/
#if (CFG_TUD_MSC_EP_BUFSIZE != USB_MSC_BLOCK_SIZE)
#error "CFG_TUD_MSC_EP_BUFSIZE should equal the FAT12 partition block size."
#endif


/****************************************************************************************
* Type definitions
****************************************************************************************/
/** \brief   Enumerated types with the mode in which files are copied to the FAT12
 *           partition.
 *  \details There are two modes:
 *           1. USB_MSC_MODE_ROOTDIR_FIRST: The host first updates the root directory
 *              (LBA 3) and then writes the file's data to the data clusters of the
 *              partition. Typical for Windows.
 *           2. USB_MSC_MODE_ROOTDIR_LAST: The host first writes the file's data to the
 *              data clusters of the partition and afterwards it updates the root
 *              directory (LBA 3). Typical for Linux.
 *           When no files have yet been copied, the mode is not yet know and therefore
 *           USB_MSC_MODE_UNKNOWN was added.
 */
typedef enum
{
  USB_MSC_MODE_UNKNOWN = 0,
  USB_MSC_MODE_ROOTDIR_FIRST,
  USB_MSC_MODE_ROOTDIR_LAST
} tUsbMscMode;

/** \brief Type for grouping together data for tracking firmware update related info. */
typedef struct
{
  tUsbMscMode mode;               /**< File copy mode used by the host.                */
  blt_bool    updateStarted;      /**< Flag to track if firmware update started.       */
  blt_int32u  fileSize;           /**< File size extracted from LBA 3 write command.   */
  blt_int32u  fileDataWritten;    /**< Number of bytes written to flash                */
  blt_int32u  startLba;           /**< Start LBA number for writing file data.         */
  blt_bool    finish;             /**< Request flag to finish the firmware update.    */
} tUsbMscUpdateInfo;

/** \brief Layout of a file or directory entry in the root directory of a FAT partition.
 *         LBA 3 is the root directory with up to 16 entries of each 32 bytes. This
 *         type matches the 32 bytes of such an entry.
 */
typedef struct TU_ATTR_PACKED
{
  blt_char   filename[8];                        /* Offset 0x00                        */
  blt_char   extension[3];                       /* Offset 0x08                        */
  blt_int8u  attributes;                         /* Offset 0x0B                        */
  blt_int8u  reserved_nt;                        /* Offset 0x0C                        */
  blt_int8u  create_tenths;                      /* Offset 0x0D                        */
  blt_int16u create_time;                        /* Offset 0x0E  (packed fat_time)     */
  blt_int16u create_date;                        /* Offset 0x10  (packed fat_date)     */
  blt_int16u access_date;                        /* Offset 0x12                        */
  blt_int16u cluster_high;                       /* Offset 0x14  (0 for FAT12/FAT16)   */
  blt_int16u write_time;                         /* Offset 0x16                        */
  blt_int16u write_date;                         /* Offset 0x18                        */
  blt_int16u cluster_low;                        /* Offset 0x1A                        */
  blt_int32u file_size;                          /* Offset 0x1C                        */
} tUsbMscRootDirEntry;


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_int16u UsbMscGetUserProgBlocks(void);
static blt_bool   UsbMscWriteDataToFlash(blt_int32u lba, blt_int32u offset,
                                         blt_int8u * data, blt_int32u len);
static blt_bool   UsbMscFinishFirmwareUpdate(void);


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief Boolean flag to keep track if the MSC device was ejected from the USB host. */
static blt_bool usbMscEjected = BLT_FALSE;

